# Welcome

## Merging in Pandas

Date: 11/17/2023

Data Analytics Working Group

## Goal

* Learn the Pandas merging method 

* Reference, https://pandas.pydata.org/docs/user_guide/merging.html

These notes will be available on [here](https://github.com/youngsuKim-CSUSB/presentations), https://github.com/youngsuKim-CSUSB/presentations.

# Preliminaries

## Basic JupyterLab 

* How to execute cells
* How to install Python packages

## Import Pandas and CSV files

We first load the package Matplotlib by typing

> import pandas as pd  
> pd.read_csv(filename)

In [1]:
import pandas as pd

If the package is not installed, you can try one of the following methods without leaving the JupyterLab.

> conda install pandas

> pip install pandas

# Load CSV files as Datasets

Use `pd.read_csv(filename)` but first download the CSV files by typing

In [84]:
# Load tables for exercises
df1 = pd.read_csv("table1.csv")
df2 = pd.read_csv("table2.csv")
df3 = pd.read_csv("table3.csv")
df4 = pd.read_csv("table4.csv")
df5 = pd.read_csv("table5.csv")
df6 = pd.read_csv("table6.csv")
df7 = pd.read_csv("table7.csv")

In [85]:
# pd.read_csv?

In [86]:
# print df1
df1

   Column A  Column B
0         1        10
1         2        20
2         3        30
3         4        40
4         5        50

In [96]:
# print df2
# Write your code below

TypeError: 'RangeIndex' object is not callable

Example:

Use `pd.concat` to concatenate df1 and df2 row-wise

In [69]:
# pd.concat()
pd.concat([df1,df3], join="outer")

   Column A  Column B
0         1        10
1         2        20
2         3        30
3         4        40
4         5        50
0         4        40
1         9        90

Student Exercise:

Use `pd.concat` to concatenate df1 and df3 row-wise

In [65]:
# pd.concat()

In [68]:
# Use the join="outer" argument to remove the duplicate
pd.concat([df1,df3], join="inner")

   Column A  Column B
0         1        10
1         2        20
2         3        30
3         4        40
4         5        50
0         4        40
1         9        90

In [18]:
pd.merge(df5,df7, on=['Column A'], how='outer')

   Column A  Column B  Column C
0         3      30.0       6.0
1         6      60.0       NaN
2         1       NaN       2.0
3         2       NaN       4.0
4         4       NaN       8.0
5         5       NaN      10.0

In [20]:
pd.merge(df5,df7, how='cross')

   Column A_x  Column B  Column A_y  Column C
0           3        30           1         2
1           3        30           2         4
2           3        30           3         6
3           3        30           4         8
4           3        30           5        10
5           6        60           1         2
6           6        60           2         4
7           6        60           3         6
8           6        60           4         8
9           6        60           5        10

In [37]:
# NaN means not a number

## Task

Counter the number of attendance points for this week.

1. Read files
> [ "roster.csv", "11-13-2023.csv", "11-14-2023.csv", "11-15-2023.csv", "11-17-2023.csv" ]
2. Merge data one by one
4. Replace NaN by 0
3. Create a column with the sum

In [45]:
# 1

files = [ "roster.csv", "11-13-2023.csv", "11-14-2023.csv", "11-15-2023.csv", "11-17-2023.csv" ]

roster = pd.read_csv(files[0])
df13 = pd.read_csv(files[1])
df14 = pd.read_csv(files[2])
df15 = pd.read_csv(files[3])
df17 = pd.read_csv(files[4])

In [46]:
roster

        Name
0  Student A
1  Student B
2  Student C
3  Student D
4  Student E
5  Student F
6  Student G
7  Student H

In [47]:
df13

        Name  11/13/23
0  Student A         1
1  Student D         2
2  Student C         1
3  Student E         2
4  Student B         1

In [64]:
df = pd.merge(roster, df13, on='Name', how='left')

        Name  11/13/23  11/14/23  11/15/23  11/17/23  Total
0  Student A       1.0       0.0       1.0       0.0    2.0
1  Student B       1.0       2.0       0.0       0.0    3.0
2  Student C       1.0       0.0       2.0       2.0    3.0
3  Student D       2.0       1.0       1.0       2.0    4.0
4  Student E       2.0       1.0       1.0       0.0    4.0
5  Student F       0.0       0.0       1.0       1.0    1.0
6  Student G       0.0       1.0       2.0       2.0    3.0
7  Student H       0.0       2.0       2.0       1.0    4.0

In [26]:
left = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)

right = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

result = pd.merge(left, right, on="key", how='outer')

In [27]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [28]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [29]:
result

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [51]:
left = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)

right = pd.DataFrame(
    {
        "key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)


result = pd.merge(left, right, on=["key1", "key2"]) #, indicator=True) #, validate='1:m')
result2 = pd.merge(left, right, on=["key1", "key2"], how='left')
result3 = pd.merge(left, right, on=["key1", "key2"], how='right')

In [52]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [53]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [ ]:
result

In [55]:
result2

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [56]:
result3

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

# Questions?

## Thank you!